--------- beginning of kernel
05-10 22:58:16.205     0     0 I         : Booting Linux on physical CPU 0x0000000000 [0x00000000]
05-10 22:58:16.205     0     0 I         : Linux version 5.15.41-android13-8-00055-g4f5025129fe8-ab8949913 (build-user@build-host) (Android (8508608, based on r450784e) clang version 14.0.7 (https://android.googlesource.com/toolchain/llvm-project 4c603efb0cca074e9238af8b4106c30add4418f6), LLD 14.0.7) #1 SMP PREEMPT Mon Aug 15 18:33:14 UTC 2022
05-10 22:58:16.205     0     0 I Machine model: linux,ranchu
05-10 22:58:16.205     0     0 I         : Stack Depot is disabled
05-10 22:58:16.205     0     0 I printk  : debug: skip boot console de-registration.
05-10 22:58:16.205     0     0 I efi     : UEFI not found.
05-10 22:58:16.205     0     0 I Zone ranges:  
05-10 22:58:16.205     0     0 I         : DMA32    [mem 0x0000000040000000-0x00000000bfffffff]
05-10 22:58:16.205     0     0 I         : Normal   empty
05-10 22:58:16.205     0     0 I         : Movable zone start for each node
05-10 22:58:16.205     0     0 I         : Early memory node ranges
05-10 22:58:16.205     0     0 I node   0: [mem 0x0000000040000000-0x00000000bfffffff]
05-10 22:58:16.205     0     0 I         : Initmem setup node 0 [mem 0x0000000040000000-0x00000000bfffffff]
05-10 22:58:16.205     0     0 I cma     : Reserved 296 MiB at 0x00000000ab000000
05-10 22:58:16.205     0     0 I psci    : probing for conduit method from DT.

05-10 22:58:16.513     1     1 I device-mapper: ioctl: 4.45.0-ioctl (2021-03-22) initialised: dm-devel@redhat.com
05-10 22:58:16.513     1     1 I Bluetooth: HCI UART driver ver 2.3
05-10 22:58:16.513     1     1 I Bluetooth: HCI UART protocol H4 registered
05-10 22:58:16.513     1     1 I Bluetooth: HCI UART protocol LL registered
05-10 22:58:16.513     1     1 I Bluetooth: HCI UART protocol Broadcom registered
05-10 22:58:16.513     1     1 I Bluetooth: HCI UART protocol QCA registered
05-10 22:58:16.513     1     1 I sdhci   : Secure Digital Host Controller Interface driver
05-10 22:58:16.513     1     1 I sdhci   : Copyright(c) Pierre Ossman
05-10 22:58:16.513     1     1 I sdhci-pltfm: SDHCI platform and OF driver helper
05-10 22:58:16.513     1     1 I hid     : raw HID events driver (C) Jiri Kosina
05-10 22:58:16.513     1     1 I usbcore : registered new interface driver usbhid
05-10 22:58:16.513     1     1 I usbhid  : USB HID core driver
05-10 22:58:16.513     1     1 I ashmem  : initialized
05-10 22:58:16.513     1     1 I gnss    : GNSS driver registered with major 509
05-10 22:58:16.513     1     1 I usbcore : registered new interface driver snd-usb-audio
05-10 22:58:16.513     1     1 I         : GACT probability NOT on
05-10 22:58:16.513     1     1 I         : Mirror/redirect action on
05-10 22:58:16.513     1     1 I netem   : version 1.3
05-10 22:58:16.514     1     1 I         : u32 classifier
05-10 22:58:16.514     1     1 I         : input device check on
05-10 22:58:16.514     1     1 I         : Actions configured
05-10 22:58:16.514     1     1 I xt_time : kernel timezone is -0000
05-10 22:58:16.514     1     1 I ipip    : IPv4 and MPLS over IPv4 tunneling driver
05-10 22:58:16.514     1     1 I gre     : GRE over IPv4 demultiplexor driver
05-10 22:58:16.514     1     1 I ip_gre  : GRE over IPv4 tunneling driver
05-10 22:58:16.514     1     1 I         : IPv4 over IPsec tunneling driver
05-10 22:58:16.515     1     1 I         : Initializing XFRM netlink socket
05-10 22:58:16.515     1     1 I         : IPsec XFRM device driver
05-10 22:58:16.515     1     1 I NET     : Registered PF_INET6 protocol family
05-10 22:58:16.516     1     1 I         : Segment Routing with IPv6
05-10 22:58:16.516     1     1 I         : In-situ OAM (IOAM) with IPv6
05-10 22:58:16.516     1     1 I mip6    : Mobile IPv6
05-10 22:58:16.516     1     1 I sit     : IPv6, IPv4 and MPLS over IPv4 tunneling driver
05-10 22:58:16.516     1     1 I ip6_gre : GRE over IPv6 tunneling driver
05-10 22:58:16.516     1     1 I NET     : Registered PF_PACKET protocol family
05-10 22:58:16.516     1     1 I NET     : Registered PF_KEY protocol family
05-10 22:58:16.516     1     1 I can     : controller area network core
05-10 22:58:16.516     1     1 I NET     : Registered PF_CAN protocol family
05-10 22:58:16.516     1     1 I can     : raw protocol
05-10 22:58:16.516     1     1 I can     : broadcast manager protocol
05-10 22:58:16.516     1     1 I can     : netlink gateway - max_hops=1
05-10 22:58:16.516     1     1 I Bluetooth: RFCOMM TTY layer initialized
05-10 22:58:16.516     1     1 I Bluetooth: RFCOMM socket layer initialized
05-10 22:58:16.516     1     1 I Bluetooth: RFCOMM ver 1.11
05-10 22:58:16.516     1     1 I Bluetooth: HIDP (Human Interface Emulation) ver 1.2
05-10 22:58:16.516     1     1 I Bluetooth: HIDP socket layer initialized
05-10 22:58:16.516     1     1 I l2tp_core: L2TP core driver, V2.0
05-10 22:58:16.516     1     1 I l2tp_ppp: PPPoL2TP kernel driver, V2.0
05-10 22:58:16.516     1     1 I 8021q   : 802.1Q VLAN Support v1.8
05-10 22:58:16.516     1     1 I tipc    : Activated (version 2.0.0)
05-10 22:58:16.517     1     1 I NET     : Registered PF_TIPC protocol family
05-10 22:58:16.517     1     1 I tipc    : Started in single node mode
05-10 22:58:16.517     1     1 I NET     : Registered PF_IEEE802154 protocol family
05-10 22:58:16.517     1     1 I NET     : Registered PF_VSOCK protocol family
05-10 22:58:16.517     1     1 I         : registered taskstats version 1
05-10 22:58:16.517     1     1 I         : Loading compiled-in X.509 certificates
05-10 22:58:16.518     1     1 I         : Loaded X.509 cert 'Build time autogenerated kernel key: 1136761ace0a26a2f73cf07655860ac1e95e7dfa'
05-10 22:58:16.519     1     1 I         : page_owner is disabled
05-10 22:58:16.519     1     1 I         : Key type ._fscrypt registered
05-10 22:58:16.519     1     1 I         : Key type .fscrypt registered
05-10 22:58:16.519     1     1 I         : Key type fscrypt-provisioning registered
05-10 22:58:16.520     1     1 I input   : gpio-keys as /devices/platform/gpio-keys/input/input0
05-10 22:58:16.520     1     1 I         : ALSA device list:
05-10 22:58:16.520     1     1 I         : No soundcards found.
05-10 22:58:16.520     1     1 E         : Warning: unable to open an initial console.
05-10 22:58:16.520     1     1 I         : Freeing unused kernel memory: 2496K
05-10 22:58:16.553     1     1 I         : Run /init as init process
05-10 22:58:16.553     1     1 D with arguments:  
05-10 22:58:16.553     1     1 D         : /init
05-10 22:58:16.553     1     1 D         : no_timer_check
05-10 22:58:16.553     1     1 D with environment:  
05-10 22:58:16.553     1     1 D         : HOME=/
05-10 22:58:16.553     1     1 D         : TERM=linux
05-10 22:58:16.553     1     1 D         : earlyprintk=ttyAMA0
05-10 22:58:16.553     1     1 D         : ndns=2
05-10 22:58:16.554     1     1 I init    : init first stage started!
05-10 22:58:16.555     1     1 I init    : Loading module /lib/modules/ambakmi.ko with args ''
05-10 22:58:16.555     1     1 I ambakmi : module verification failed: signature and/or required key missing - tainting kernel
05-10 22:58:16.630     1     1 I init    : Loaded kernel module /lib/modules/ambakmi.ko
05-10 22:58:16.630     1     1 I init    : Loading module /lib/modules/armmmci.ko with args ''
05-10 22:58:16.663     1     1 E BPF     : type_id=1484 bitfield_size=4 bits_offset=1864
05-10 22:58:16.663     1     1 E BPF     :  
05-10 22:58:16.663     1     1 E BPF     : Invalid name
05-10 22:58:16.663     1     1 E BPF     :  
05-10 22:58:16.663     1     1 W         : failed to validate module [armmmci] BTF: -22
05-10 22:58:16.663     1     1 I init    : Loaded kernel module /lib/modules/armmmci.ko
05-10 22:58:16.663     1     1 I init    : Loading module /lib/modules/btintel.ko with args ''
05-10 22:58:16.697     1     1 E BPF     : type_id=1484 bits_offset=24
05-10 22:58:16.697     1     1 E BPF     :  
05-10 22:58:16.697     1     1 E BPF     : Invalid name
05-10 22:58:16.697     1     1 E BPF     :  
05-10 22:58:16.697     1     1 W         : failed to validate module [btintel] BTF: -22
05-10 22:58:16.697     1     1 I init    : Loaded kernel module /lib/modules/btintel.ko
05-10 22:58:16.698     1     1 I init    : Loading module /lib/modules/btrtl.ko with args ''
05-10 22:58:16.729     1     1 E BPF     : type_id=1488 bits_offset=0
05-10 22:58:16.729     1     1 E BPF     :  
05-10 22:58:16.729     1     1 E BPF     : Invalid name
05-10 22:58:16.729     1     1 E BPF     :  
05-10 22:58:16.729     1     1 W         : failed to validate module [btrtl] BTF: -22
05-10 22:58:16.729     1     1 I init    : Loaded kernel module /lib/modules/btrtl.ko
05-10 22:58:16.729     1     1 I init    : Loading module /lib/modules/btusb.ko with args ''
05-10 22:58:16.762     1     1 I usbcore : registered new interface driver btusb
05-10 22:58:16.762     1     1 I init    : Loaded kernel module /lib/modules/btusb.ko
05-10 22:58:16.762     1     1 I init    : Loading module /lib/modules/cfg80211.ko with args ''
05-10 22:58:16.813     1     1 E BPF     : type_id=34660 bits_offset=896
05-10 22:58:16.813     1     1 E BPF     :  
05-10 22:58:16.813     1     1 E BPF     : Invalid name
05-10 22:58:16.813     1     1 E BPF     :  
05-10 22:58:16.813     1     1 W         : failed to validate module [cfg80211] BTF: -22
05-10 22:58:16.813     1     1 I cfg80211: Loading compiled-in X.509 certificates for regulatory database
05-10 22:58:16.814     1     1 I cfg80211: Loaded X.509 cert 'sforshee: 00b28ddf47aef9cea7'
05-10 22:58:16.814    19    19 W platform regulatory.0: Direct firmware load for regulatory.db failed with error -2
05-10 22:58:16.814    19    19 I cfg80211: failed to load regulatory.db
05-10 22:58:16.815     1     1 I init    : Loaded kernel module /lib/modules/cfg80211.ko
05-10 22:58:16.815     1     1 I init    : Loading module /lib/modules/vexpress-config.ko with args ''
05-10 22:58:16.859     1     1 I init    : Loaded kernel module /lib/modules/vexpress-config.ko
05-10 22:58:16.859     1     1 I init    : Loading module /lib/modules/clk-vexpress-osc.ko with args ''
05-10 22:58:16.904     1     1 I init    : Loaded kernel module /lib/modules/clk-vexpress-osc.ko
05-10 22:58:16.904     1     1 I init    : Loading module /lib/modules/dummy-cpufreq.ko with args ''
05-10 22:58:16.959     1     1 I init    : Loaded kernel module /lib/modules/dummy-cpufreq.ko
05-10 22:58:16.959     1     1 I init    : Loading module /lib/modules/dummy_hcd.ko with args ''
05-10 22:58:17.019     1     1 E BPF     : type_id=1508 bitfield_size=0 bits_offset=576
05-10 22:58:17.019     1     1 E BPF     :  
05-10 22:58:17.019     1     1 E BPF     : Invalid name
05-10 22:58:17.019     1     1 E BPF     :  
05-10 22:58:17.019     1     1 W         : failed to validate module [dummy_hcd] BTF: -22
05-10 22:58:17.019     1     1 I dummy_hcd.0: USB Host+Gadget Emulator, driver 02 May 2005
05-10 22:58:17.019     1     1 I dummy_hcd.0: Dummy host controller
05-10 22:58:17.019     1     1 I dummy_hcd.0: new USB bus registered, assigned bus number 1
05-10 22:58:17.019     1     1 I usb1    : New USB device found, idVendor=1d6b, idProduct=0002, bcdDevice= 5.15
05-10 22:58:17.019     1     1 I usb1    : New USB device strings: Mfr=3, Product=2, SerialNumber=1
05-10 22:58:17.019     1     1 I usb1    : Product: Dummy host controller
05-10 22:58:17.019     1     1 I usb1    : Manufacturer: Linux 5.15.41-android13-8-00055-g4f5025129fe8-ab8949913 dummy_hcd
05-10 22:58:17.019     1     1 I usb1    : SerialNumber: dummy_hcd.0
05-10 22:58:17.019     1     1 I hub 1-0 : 1.0: USB hub found
05-10 22:58:17.019     1     1 I hub 1-0 : 1.0: 1 port detected
05-10 22:58:17.020     1     1 I init    : Loaded kernel module /lib/modules/dummy_hcd.ko
05-10 22:58:17.020     1     1 I init    : Loading module /lib/modules/e1000.ko with args ''
05-10 22:58:17.064     1     1 E BPF     : [128793] ENUM (anon)
05-10 22:58:17.064     1     1 E BPF     : size=4 vlen=16
05-10 22:58:17.064     1     1 E BPF     :  
05-10 22:58:17.064     1     1 E BPF     : Invalid name
05-10 22:58:17.064     1     1 E BPF     :  
05-10 22:58:17.064     1     1 W         : failed to validate module [e1000] BTF: -22
05-10 22:58:17.064     1     1 I e1000   : Intel(R) PRO/1000 Network Driver
05-10 22:58:17.064     1     1 I e1000   : Copyright (c) 1999-2006 Intel Corporation.
05-10 22:58:17.064     1     1 I init    : Loaded kernel module /lib/modules/e1000.ko
05-10 22:58:17.065     1     1 I init    : Loading module /lib/modules/failover.ko with args ''
05-10 22:58:17.098     1     1 I init    : Loaded kernel module /lib/modules/failover.ko
05-10 22:58:17.098     1     1 I init    : Loading module /lib/modules/goldfish_address_space.ko with args ''
05-10 22:58:17.098     1     1 W goldfish_address_space: loading out-of-tree module taints kernel.
05-10 22:58:17.144     1     1 I goldfish_address_space 0000: 00:0b.0: enabling device (0000 -> 0002)
05-10 22:58:17.145     1     1 I init    : Loaded kernel module /lib/modules/goldfish_address_space.ko
05-10 22:58:17.145     1     1 I init    : Loading module /lib/modules/goldfish_battery.ko with args ''
05-10 22:58:17.177     1     1 I init    : Loaded kernel module /lib/modules/goldfish_battery.ko
05-10 22:58:17.177     1     1 I init    : Loading module /lib/modules/goldfish_pipe.ko with args ''
05-10 22:58:17.210     1     1 I init    : Loaded kernel module /lib/modules/goldfish_pipe.ko
05-10 22:58:17.210     1     1 I init    : Loading module /lib/modules/goldfish_sync.ko with args ''
05-10 22:58:17.258     1     1 I init    : Loaded kernel module /lib/modules/goldfish_sync.ko
05-10 22:58:17.259     1     1 I init    : Loading module /lib/modules/gs_usb.ko with args ''
05-10 22:58:17.323     1     1 I usbcore : registered new interface driver gs_usb
05-10 22:58:17.323     1     1 I init    : Loaded kernel module /lib/modules/gs_usb.ko
05-10 22:58:17.323     1     1 I init    : Loading module /lib/modules/hci_vhci.ko with args ''
05-10 22:58:17.371     1     1 I init    : Loaded kernel module /lib/modules/hci_vhci.ko
05-10 22:58:17.371     1     1 I init    : Loading module /lib/modules/mac80211.ko with args ''
05-10 22:58:17.424     1     1 E BPF     : 2p_noa_index type_id=2264 bitfield_size=0 bits_offset=4592
05-10 22:58:17.424     1     1 E BPF     :  
05-10 22:58:17.424     1     1 E BPF     : Invalid name
05-10 22:58:17.424     1     1 E BPF     :  
05-10 22:58:17.424     1     1 W         : failed to validate module [mac80211] BTF: -22
05-10 22:58:17.425     1     1 I init    : Loaded kernel module /lib/modules/mac80211.ko
05-10 22:58:17.425     1     1 I init    : Loading module /lib/modules/mac80211_hwsim.ko with args 'radios=0
05-10 22:58:17.425     1     1 I init    : '
05-10 22:58:17.468     1     1 E BPF     : 2p type_id=1538 bits_offset=6640
05-10 22:58:17.468     1     1 E BPF     :  
05-10 22:58:17.468     1     1 E BPF     : Invalid name
05-10 22:58:17.468     1     1 E BPF     :  
05-10 22:58:17.468     1     1 W         : failed to validate module [mac80211_hwsim] BTF: -22
05-10 22:58:17.468     1     1 I mac80211_hwsim: initializing netlink
05-10 22:58:17.469     1     1 I init    : Loaded kernel module /lib/modules/mac80211_hwsim.ko
05-10 22:58:17.469     1     1 I init    : Loading module /lib/modules/mt76.ko with args ''
05-10 22:58:17.515     1     1 E BPF     : type_id=1508 bits_offset=320
05-10 22:58:17.515     1     1 E BPF     :  
05-10 22:58:17.515     1     1 E BPF     : Invalid name
05-10 22:58:17.515     1     1 E BPF     :  
05-10 22:58:17.515     1     1 W         : failed to validate module [mt76] BTF: -22
05-10 22:58:17.515     1     1 I init    : Loaded kernel module /lib/modules/mt76.ko
05-10 22:58:17.515     1     1 I init    : Loading module /lib/modules/mt76-usb.ko with args ''
05-10 22:58:17.579     1     1 E BPF     : type_id=1508 bits_offset=320
05-10 22:58:17.579     1     1 E BPF     :  
05-10 22:58:17.579     1     1 E BPF     : Invalid name
05-10 22:58:17.579     1     1 E BPF     :  
05-10 22:58:17.579     1     1 W         : failed to validate module [mt76_usb] BTF: -22
05-10 22:58:17.580     1     1 I init    : Loaded kernel module /lib/modules/mt76-usb.ko
05-10 22:58:17.580     1     1 I init    : Loading module /lib/modules/mt76x02-lib.ko with args ''
05-10 22:58:17.627     1     1 E BPF     : type_id=1508 bits_offset=320
05-10 22:58:17.627     1     1 E BPF     :  
05-10 22:58:17.627     1     1 E BPF     : Invalid name
05-10 22:58:17.627     1     1 E BPF     :  
05-10 22:58:17.627     1     1 W         : failed to validate module [mt76x02_lib] BTF: -22
05-10 22:58:17.627     1     1 I init    : Loaded kernel module /lib/modules/mt76x02-lib.ko
05-10 22:58:17.627     1     1 I init    : Loading module /lib/modules/mt76x0-common.ko with args ''
05-10 22:58:17.673     1     1 E BPF     : type_id=1508 bits_offset=320
05-10 22:58:17.673     1     1 E BPF     :  
05-10 22:58:17.673     1     1 E BPF     : Invalid name
05-10 22:58:17.673     1     1 E BPF     :  
05-10 22:58:17.673     1     1 W         : failed to validate module [mt76x0_common] BTF: -22
05-10 22:58:17.673     1     1 I init    : Loaded kernel module /lib/modules/mt76x0-common.ko
05-10 22:58:17.674     1     1 I init    : Loading module /lib/modules/mt76x02-usb.ko with args ''
05-10 22:58:17.723     1     1 E BPF     : type_id=1508 bits_offset=320
05-10 22:58:17.723     1     1 E BPF     :  
05-10 22:58:17.723     1     1 E BPF     : Invalid name
05-10 22:58:17.723     1     1 E BPF     :  
05-10 22:58:17.723     1     1 W         : failed to validate module [mt76x02_usb] BTF: -22
05-10 22:58:17.723     1     1 I init    : Loaded kernel module /lib/modules/mt76x02-usb.ko
05-10 22:58:17.724     1     1 I init    : Loading module /lib/modules/mt76x0u.ko with args ''
05-10 22:58:17.767     1     1 E BPF     : 1_band type_id=1484 bitfield_size=0 bits_offset=328
05-10 22:58:17.767     1     1 E BPF     :  
05-10 22:58:17.767     1     1 E BPF     : Invalid name
05-10 22:58:17.767     1     1 E BPF     :  
05-10 22:58:17.767     1     1 W         : failed to validate module [mt76x0u] BTF: -22
05-10 22:58:17.767     1     1 I usbcore : registered new interface driver mt76x0u
05-10 22:58:17.767     1     1 I init    : Loaded kernel module /lib/modules/mt76x0u.ko
05-10 22:58:17.767     1     1 I init    : Loading module /lib/modules/mt76x2-common.ko with args ''
05-10 22:58:17.818     1     1 E BPF     : type_id=1508 bits_offset=320
05-10 22:58:17.818     1     1 E BPF     :  
05-10 22:58:17.818     1     1 E BPF     : Invalid name
05-10 22:58:17.818     1     1 E BPF     :  
05-10 22:58:17.818     1     1 W         : failed to validate module [mt76x2_common] BTF: -22
05-10 22:58:17.818     1     1 I init    : Loaded kernel module /lib/modules/mt76x2-common.ko
05-10 22:58:17.818     1     1 I init    : Loading module /lib/modules/mt76x2u.ko with args ''
05-10 22:58:17.863     1     1 E BPF     : 1_band type_id=1484 bitfield_size=0 bits_offset=328
05-10 22:58:17.863     1     1 E BPF     :  
05-10 22:58:17.863     1     1 E BPF     : Invalid name
05-10 22:58:17.863     1     1 E BPF     :  
05-10 22:58:17.863     1     1 W         : failed to validate module [mt76x2u] BTF: -22
05-10 22:58:17.863     1     1 I usbcore : registered new interface driver mt76x2u
05-10 22:58:17.863     1     1 I init    : Loaded kernel module /lib/modules/mt76x2u.ko
05-10 22:58:17.863     1     1 I init    : Loading module /lib/modules/nd_virtio.ko with args ''
05-10 22:58:17.898     1     1 I init    : Loaded kernel module /lib/modules/nd_virtio.ko
05-10 22:58:17.898     1     1 I init    : Loading module /lib/modules/net_failover.ko with args ''
05-10 22:58:17.964     1     1 I init    : Loaded kernel module /lib/modules/net_failover.ko
05-10 22:58:17.964     1     1 I init    : Loading module /lib/modules/open-dice.ko with args ''
05-10 22:58:18.008     1     1 I init    : Loaded kernel module /lib/modules/open-dice.ko
05-10 22:58:18.008     1     1 I init    : Loading module /lib/modules/pl111_drm.ko with args ''
05-10 22:58:18.041     1     1 I init    : Loaded kernel module /lib/modules/pl111_drm.ko
05-10 22:58:18.041     1     1 I init    : Loading module /lib/modules/psmouse.ko with args ''
05-10 22:58:18.073     1     1 E BPF     : type_id=1508 bits_offset=160
05-10 22:58:18.073     1     1 E BPF     :  
05-10 22:58:18.073     1     1 E BPF     : Invalid name
05-10 22:58:18.073     1     1 E BPF     :  
05-10 22:58:18.073     1     1 W         : failed to validate module [psmouse] BTF: -22
05-10 22:58:18.073     1     1 I init    : Loaded kernel module /lib/modules/psmouse.ko
05-10 22:58:18.073     1     1 I init    : Loading module /lib/modules/pulse8-cec.ko with args ''
05-10 22:58:18.103     1     1 I init    : Loaded kernel module /lib/modules/pulse8-cec.ko
05-10 22:58:18.103     1     1 I init    : Loading module /lib/modules/rtc-test.ko with args ''
05-10 22:58:18.137     1     1 I rtc-test.0: registered as rtc1
05-10 22:58:18.137     1     1 I rtc-test.1: registered as rtc2
05-10 22:58:18.137     1     1 I rtc-test.2: registered as rtc3
05-10 22:58:18.137     1     1 I init    : Loaded kernel module /lib/modules/rtc-test.ko
05-10 22:58:18.137     1     1 I init    : Loading module /lib/modules/slcan.ko with args ''
05-10 22:58:18.187     1     1 I slcan   : serial line CAN interface driver
05-10 22:58:18.187     1     1 I slcan   : 10 dynamic interface channels.
05-10 22:58:18.187     1     1 I init    : Loaded kernel module /lib/modules/slcan.ko
05-10 22:58:18.187     1     1 I init    : Loading module /lib/modules/system_heap.ko with args ''
05-10 22:58:18.250     1     1 E BPF     : type_id=51 bits_offset=64
05-10 22:58:18.250     1     1 E BPF     :  
05-10 22:58:18.250     1     1 E BPF     : Invalid name
05-10 22:58:18.250     1     1 E BPF     :  
05-10 22:58:18.250     1     1 W         : failed to validate module [system_heap] BTF: -22
05-10 22:58:18.250     1     1 I init    : Loaded kernel module /lib/modules/system_heap.ko
05-10 22:58:18.250     1     1 I init    : Loading module /lib/modules/usbip-core.ko with args ''
05-10 22:58:18.313     1     1 E BPF     : type_id=1575 bits_offset=64
05-10 22:58:18.313     1     1 E BPF     :  
05-10 22:58:18.313     1     1 E BPF     : Invalid name
05-10 22:58:18.313     1     1 E BPF     :  
05-10 22:58:18.313     1     1 W         : failed to validate module [usbip_core] BTF: -22
05-10 22:58:18.313     1     1 I init    : Loaded kernel module /lib/modules/usbip-core.ko
05-10 22:58:18.313     1     1 I init    : Loading module /lib/modules/vcan.ko with args ''
05-10 22:58:18.346     1     1 I vcan    : Virtual CAN interface driver
05-10 22:58:18.346     1     1 I init    : Loaded kernel module /lib/modules/vcan.ko
05-10 22:58:18.346     1     1 I init    : Loading module /lib/modules/vexpress-sysreg.ko with args ''
05-10 22:58:18.412     1     1 I init    : Loaded kernel module /lib/modules/vexpress-sysreg.ko
05-10 22:58:18.412     1     1 I init    : Loading module /lib/modules/vhci-hcd.ko with args ''
05-10 22:58:18.457     1     1 E BPF     : type_id=6219 bitfield_size=0 bits_offset=64
05-10 22:58:18.457     1     1 E BPF     :  
05-10 22:58:18.457     1     1 E BPF     : Invalid name
05-10 22:58:18.457     1     1 E BPF     :  
05-10 22:58:18.457     1     1 W         : failed to validate module [vhci_hcd] BTF: -22
05-10 22:58:18.458     1     1 I vhci_hcd.0: USB/IP Virtual Host Controller
05-10 22:58:18.458     1     1 I vhci_hcd.0: new USB bus registered, assigned bus number 2
05-10 22:58:18.458     1     1 I vhci_hcd: created sysfs vhci_hcd.0
05-10 22:58:18.458     1     1 I usb2    : New USB device found, idVendor=1d6b, idProduct=0002, bcdDevice= 5.15
05-10 22:58:18.458     1     1 I usb2    : New USB device strings: Mfr=3, Product=2, SerialNumber=1
05-10 22:58:18.458     1     1 I usb2    : Product: USB/IP Virtual Host Controller
05-10 22:58:18.458     1     1 I usb2    : Manufacturer: Linux 5.15.41-android13-8-00055-g4f5025129fe8-ab8949913 vhci_hcd
05-10 22:58:18.458     1     1 I usb2    : SerialNumber: vhci_hcd.0
05-10 22:58:18.458     1     1 I hub 2-0 : 1.0: USB hub found
05-10 22:58:18.458     1     1 I hub 2-0 : 1.0: 8 ports detected
05-10 22:58:18.458     1     1 I vhci_hcd.0: USB/IP Virtual Host Controller
05-10 22:58:18.458     1     1 I vhci_hcd.0: new USB bus registered, assigned bus number 3
05-10 22:58:18.458     1     1 I usb3    : We don't know the algorithms for LPM for this host, disabling LPM.
05-10 22:58:18.458     1     1 I usb3    : New USB device found, idVendor=1d6b, idProduct=0003, bcdDevice= 5.15
05-10 22:58:18.458     1     1 I usb3    : New USB device strings: Mfr=3, Product=2, SerialNumber=1
05-10 22:58:18.458     1     1 I usb3    : Product: USB/IP Virtual Host Controller
05-10 22:58:18.458     1     1 I usb3    : Manufacturer: Linux 5.15.41-android13-8-00055-g4f5025129fe8-ab8949913 vhci_hcd
05-10 22:58:18.458     1     1 I usb3    : SerialNumber: vhci_hcd.0
05-10 22:58:18.458     1     1 I hub 3-0 : 1.0: USB hub found
05-10 22:58:18.458     1     1 I hub 3-0 : 1.0: 8 ports detected
05-10 22:58:18.458     1     1 I init    : Loaded kernel module /lib/modules/vhci-hcd.ko
05-10 22:58:18.458     1     1 I init    : Loading module /lib/modules/virt_wifi.ko with args ''
05-10 22:58:18.524     1     1 E BPF     : type_id=128837 bits_offset=2880
05-10 22:58:18.524     1     1 E BPF     :  
05-10 22:58:18.524     1     1 E BPF     : Invalid name
05-10 22:58:18.524     1     1 E BPF     :  
05-10 22:58:18.524     1     1 W         : failed to validate module [virt_wifi] BTF: -22
05-10 22:58:18.524     1     1 I init    : Loaded kernel module /lib/modules/virt_wifi.ko
05-10 22:58:18.524     1     1 I init    : Loading module /lib/modules/virtio_dma_buf.ko with args ''
05-10 22:58:18.569     1     1 I init    : Loaded kernel module /lib/modules/virtio_dma_buf.ko
05-10 22:58:18.569     1     1 I init    : Loading module /lib/modules/virtio-gpu.ko with args ''
05-10 22:58:18.615     1     1 E BPF     : type_id=22880 bits_offset=64
05-10 22:58:18.615     1     1 E BPF     :  
05-10 22:58:18.615     1     1 E BPF     : Invalid name
05-10 22:58:18.615     1     1 E BPF     :  
05-10 22:58:18.615     1     1 W         : failed to validate module [virtio_gpu] BTF: -22
05-10 22:58:18.616     1     1 I init    : Loaded kernel module /lib/modules/virtio-gpu.ko
05-10 22:58:18.616     1     1 I init    : Loading module /lib/modules/virtio-rng.ko with args ''
05-10 22:58:18.666     1     1 I init    : Loaded kernel module /lib/modules/virtio-rng.ko
05-10 22:58:18.666     1     1 I init    : Loading module /lib/modules/virtio_balloon.ko with args ''
05-10 22:58:18.732     1     1 I init    : Loaded kernel module /lib/modules/virtio_balloon.ko
05-10 22:58:18.732     1     1 I init    : Loading module /lib/modules/virtio_blk.ko with args ''
05-10 22:58:18.796     1     1 I init    : Loaded kernel module /lib/modules/virtio_blk.ko
05-10 22:58:18.796     1     1 I init    : Loading module /lib/modules/virtio_console.ko with args ''
05-10 22:58:18.842     1     1 E BPF     : [128876] FUNC
05-10 22:58:18.842     1     1 E BPF     : type_id=71791
05-10 22:58:18.842     1     1 E BPF     :  
05-10 22:58:18.842     1     1 E BPF     : Invalid name
05-10 22:58:18.842     1     1 E BPF     :  
05-10 22:58:18.842     1     1 W         : failed to validate module [virtio_console] BTF: -22
05-10 22:58:18.843     1     1 I init    : Loaded kernel module /lib/modules/virtio_console.ko
05-10 22:58:18.843     1     1 I init    : Loading module /lib/modules/virtio_input.ko with args ''
05-10 22:58:18.888     1     1 I init    : Loaded kernel module /lib/modules/virtio_input.ko
05-10 22:58:18.888     1     1 I init    : Loading module /lib/modules/virtio_mmio.ko with args ''
05-10 22:58:18.923     1     1 I virtio_blk virtio2: [vda] 8411136 512-byte logical blocks (4.31 GB/4.01 GiB)
05-10 22:58:18.924   151   151 I random  : fast init done
05-10 22:58:18.924   151   151 I random  : crng init done
05-10 22:58:18.929     1     1 I vda     : vda1 vda2
05-10 22:58:18.931     1     1 I virtio_blk virtio3: [vdb] 135168 512-byte logical blocks (69.2 MB/66.0 MiB)
05-10 22:58:18.937     1     1 I virtio_blk virtio4: [vdc] 12582912 512-byte logical blocks (6.44 GB/6.00 GiB)
05-10 22:58:18.943     1     1 I virtio_blk virtio5: [vdd] 36864 512-byte logical blocks (18.9 MB/18.0 MiB)
05-10 22:58:18.947     1     1 I vdd     : vdd1
05-10 22:58:18.949     1     1 I virtio_blk virtio6: [vde] 188416 512-byte logical blocks (96.5 MB/92.0 MiB)
05-10 22:58:18.952     1     1 I vde     : vde1
05-10 22:58:18.953     1     1 I init    : Loaded kernel module /lib/modules/virtio_mmio.ko
05-10 22:58:18.953     1     1 I init    : Loading module /lib/modules/virtio_net.ko with args ''
05-10 22:58:18.984     1     1 E BPF     : type_id=25 bits_offset=192
05-10 22:58:18.984     1     1 E BPF     :  
05-10 22:58:18.984     1     1 E BPF     : Invalid name
05-10 22:58:18.984     1     1 E BPF     :  
05-10 22:58:18.984     1     1 W         : failed to validate module [virtio_net] BTF: -22
05-10 22:58:18.985     1     1 I init    : Loaded kernel module /lib/modules/virtio_net.ko
05-10 22:58:18.985     1     1 I init    : Loading module /lib/modules/virtio_pci_modern_dev.ko with args ''
05-10 22:58:19.017     1     1 I init    : Loaded kernel module /lib/modules/virtio_pci_modern_dev.ko
05-10 22:58:19.018     1     1 I init    : Loading module /lib/modules/virtio_pci.ko with args ''
05-10 22:58:19.034     1     1 I virtio-pci 0000: 00:01.0: enabling device (0000 -> 0003)
05-10 22:58:19.035     1     1 I virtio-pci 0000: 00:02.0: enabling device (0000 -> 0003)
05-10 22:58:19.046     1     1 I virtio-pci 0000: 00:03.0: enabling device (0000 -> 0003)
05-10 22:58:19.061     1     1 I virtio-pci 0000: 00:04.0: enabling device (0000 -> 0002)
05-10 22:58:19.063     1     1 I input   : virtio_input_multi_touch_1 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:04.0/virtio10/input/input1
05-10 22:58:19.063     1     1 I virtio-pci 0000: 00:05.0: enabling device (0000 -> 0002)
05-10 22:58:19.066     1     1 I input   : virtio_input_multi_touch_2 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:05.0/virtio11/input/input2
05-10 22:58:19.066     1     1 I virtio-pci 0000: 00:06.0: enabling device (0000 -> 0002)
05-10 22:58:19.070     1     1 I input   : virtio_input_multi_touch_3 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:06.0/virtio12/input/input3
05-10 22:58:19.070     1     1 I virtio-pci 0000: 00:07.0: enabling device (0000 -> 0002)
05-10 22:58:19.073     1     1 I input   : virtio_input_multi_touch_4 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:07.0/virtio13/input/input4
05-10 22:58:19.073     1     1 I virtio-pci 0000: 00:08.0: enabling device (0000 -> 0002)
05-10 22:58:19.075     1     1 I input   : virtio_input_multi_touch_5 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:08.0/virtio14/input/input5
05-10 22:58:19.075     1     1 I virtio-pci 0000: 00:09.0: enabling device (0000 -> 0002)
05-10 22:58:19.078     1     1 I input   : virtio_input_multi_touch_6 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:09.0/virtio15/input/input6
05-10 22:58:19.078     1     1 I virtio-pci 0000: 00:0a.0: enabling device (0000 -> 0002)
05-10 22:58:19.081     1     1 I input   : virtio_input_multi_touch_7 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:0a.0/virtio16/input/input7
05-10 22:58:19.081     1     1 I virtio-pci 0000: 00:0c.0: enabling device (0000 -> 0002)
05-10 22:58:19.084     1     1 I input   : virtio_input_multi_touch_8 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:0c.0/virtio17/input/input8
05-10 22:58:19.084     1     1 I virtio-pci 0000: 00:0d.0: enabling device (0000 -> 0002)
05-10 22:58:19.087     1     1 I input   : virtio_input_multi_touch_9 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:0d.0/virtio18/input/input9
05-10 22:58:19.088     1     1 I virtio-pci 0000: 00:0e.0: enabling device (0000 -> 0002)
05-10 22:58:19.091     1     1 I input   : virtio_input_multi_touch_10 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:0e.0/virtio19/input/input10
05-10 22:58:19.091     1     1 I virtio-pci 0000: 00:0f.0: enabling device (0000 -> 0002)
05-10 22:58:19.094     1     1 I input   : virtio_input_multi_touch_11 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:0f.0/virtio20/input/input11
05-10 22:58:19.094     1     1 I virtio-pci 0000: 00:10.0: enabling device (0000 -> 0002)
05-10 22:58:19.097     1     1 I input   : qwerty2 as /devices/platform/3f000000.pcie/pci0000:00/0000:00:10.0/virtio21/input/input12
05-10 22:58:19.097     1     1 I virtio-pci 0000: 00:11.0: enabling device (0000 -> 0003)
05-10 22:58:19.098     1     1 I virtio-pci 0000: 00:11.0: virtio_pci: leaving for legacy driver
05-10 22:58:19.102     1     1 I virtio-pci 0000: 00:12.0: enabling device (0000 -> 0003)
05-10 22:58:19.103     1     1 I init    : Loaded kernel module /lib/modules/virtio_pci.ko
05-10 22:58:19.103     1     1 I init    : Loading module /lib/modules/virtio_pmem.ko with args ''
05-10 22:58:19.160     1     1 I init    : Loaded kernel module /lib/modules/virtio_pmem.ko
05-10 22:58:19.160     1     1 I init    : Loading module /lib/modules/virtio_snd.ko with args ''
05-10 22:58:19.195     1     1 E BPF     : type_id=128793 bits_offset=0
05-10 22:58:19.195     1     1 E BPF     :  
05-10 22:58:19.195     1     1 E BPF     : Invalid name
05-10 22:58:19.195     1     1 E BPF     :  
05-10 22:58:19.195     1     1 W         : failed to validate module [virtio_snd] BTF: -22
05-10 22:58:19.196     1     1 I init    : Loaded kernel module /lib/modules/virtio_snd.ko
05-10 22:58:19.196     1     1 I init    : Loading module /lib/modules/vkms.ko with args ''
05-10 22:58:19.261     1     1 E BPF     : type_id=22880 bits_offset=0
05-10 22:58:19.262     1     1 E BPF     :  
05-10 22:58:19.262     1     1 E BPF     : Invalid name
05-10 22:58:19.262     1     1 E BPF     :  
05-10 22:58:19.262     1     1 W         : failed to validate module [vkms] BTF: -22
05-10 22:58:19.263     1     1 I         : [drm] Initialized vkms 1.0.0 20180514 for vkms on minor 0
05-10 22:58:19.264     1     1 I init    : Loaded kernel module /lib/modules/vkms.ko
05-10 22:58:19.264     1     1 I init    : Loading module /lib/modules/vmw_vsock_virtio_transport.ko with args ''
05-10 22:58:19.305     1     1 I init    : Loaded kernel module /lib/modules/vmw_vsock_virtio_transport.ko
05-10 22:58:19.305     1     1 I init    : Loading module /lib/modules/zsmalloc.ko with args ''
05-10 22:58:19.337     1     1 I init    : Loaded kernel module /lib/modules/zsmalloc.ko
05-10 22:58:19.337     1     1 I init    : Loading module /lib/modules/zram.ko with args ''
05-10 22:58:19.368     1     1 I zram    : Added device: zram0
05-10 22:58:19.368     1     1 I init    : Loaded kernel module /lib/modules/zram.ko
05-10 22:58:19.368     1     1 I init    : Loaded 59 kernel modules took 2813 ms
05-10 22:58:19.368     1     1 I init    : Copied ramdisk prop to /second_stage_resources/system/etc/ramdisk/build.prop
05-10 22:58:19.368     1     1 I init    : [libfs_mgr]ReadFstabFromDt(): failed to read fstab from dt
05-10 22:58:19.369     1     1 I init    : Using Android DT directory /proc/device-tree/firmware/android/
05-10 22:58:19.369     1     1 E init    : Failed to read vbmeta partitions.
05-10 22:58:19.376     1     1 I init    : [libfs_mgr]superblock s_max_mnt_count:65535,/dev/block/platform/a003c00.virtio_mmio/by-name/metadata
05-10 22:58:19.376     1     1 I init    : [libfs_mgr]Filesystem on /dev/block/platform/a003c00.virtio_mmio/by-name/metadata was not cleanly shutdown; state flags: 0x1, incompat feature flags: 0x46
05-10 22:58:19.377     1     1 W EXT4-fs (vdd1): Ignoring removed nomblk_io_submit option
05-10 22:58:19.390     1     1 I EXT4-fs (vdd1): recovery complete
05-10 22:58:19.391     1     1 I EXT4-fs (vdd1): mounted filesystem with ordered data mode. Opts: errors=remount-ro,nomblk_io_submit. Quota mode: none.
05-10 22:58:19.391     1     1 I init    : [libfs_mgr]check_fs(): mount(/dev/block/platform/a003c00.virtio_mmio/by-name/metadata,/metadata,ext4)=0: Success
05-10 22:58:19.394     1     1 I init    : [libfs_mgr]umount_retry(): unmount(/metadata) succeeded
05-10 22:58:19.394     1     1 I init    : [libfs_mgr]Not running /system/bin/e2fsck on /dev/block/vdd1 (executable not in system image)
05-10 22:58:19.397     1     1 I EXT4-fs (vdd1): mounted filesystem with ordered data mode. Opts: . Quota mode: none.
05-10 22:58:19.397     1     1 I init    : [libfs_mgr]__mount(source=/dev/block/platform/a003c00.virtio_mmio/by-name/metadata,target=/metadata,type=ext4)=0: Success
05-10 22:58:19.397     1     1 E init    : Failed to copy /avb into /metadata/gsi/dsu/avb/: No such file or directory
05-10 22:58:19.402     1     1 I init    : [libfs_mgr]Created logical partition system on device /dev/block/dm-0
05-10 22:58:19.402     1     1 I init    : [libfs_mgr]Created logical partition system_ext on device /dev/block/dm-1
05-10 22:58:19.403     1     1 I init    : [libfs_mgr]Created logical partition product on device /dev/block/dm-2
05-10 22:58:19.403     1     1 I init    : [libfs_mgr]Created logical partition vendor on device /dev/block/dm-3
05-10 22:58:19.403     1     1 I init    : DSU not detected, proceeding with normal boot
05-10 22:58:19.404     1     1 I init    : [libfs_mgr]superblock s_max_mnt_count:65535,/dev/block/dm-0
05-10 22:58:19.406     1     1 I EXT4-fs (dm-0): mounted filesystem without journal. Opts: barrier=1. Quota mode: none.
05-10 22:58:19.406     1     1 I init    : [libfs_mgr]__mount(source=/dev/block/dm-0,target=/system,type=ext4)=0: Success
05-10 22:58:19.406     1     1 I init    : Switching root to '/system'
